gw/ctcc/ISMP/IsmpSpEngineSoapBinding.notifyManagementInfo.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns2="http://req.sp.ismp.chinatelecom.com"
  xmlns:ns3="http://rsp.sp.ismp.chinatelecom.com"
  xmlns:ns1="http://sp.ismp.chinatelecom.com">
 <SOAP-ENV:Body>
   <ns1:notifyManagementInfoReq>
    <ns2:ID></ns2:ID>
    <ns2:IDType>0</ns2:IDType>
    <ns2:status>0</ns2:status>
    <ns2:streamingNo></ns2:streamingNo>
   </ns1:notifyManagementInfoReq>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
